In [6]:
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "/Users/tony/Documents/GitHub/pandas-challenge/Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [298]:
purchase_data_df = pd.DataFrame(purchase_data)

In [299]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,age_ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [433]:
total_players_sum = purchase_data_df['SN'].unique()
len(total_players_sum)

576

In [307]:
# Purchasing Analysis (Total)
unique_items_numbers = purchase_data_df['Item ID'].unique()
unique_items =len(unique_items_numbers)
purchase_price_avg = purchase_data_df['Price'].mean()
purchase_price_total = purchase_data_df['Purchase ID'].count()
revenue_total = purchase_data_df['Price'].sum()

purchasing_analysis_total = {'Number of Unique Items':unique_items,
      'Average Price':purchase_price_avg,
    'Number of Purchases':purchase_price_total,
    'Total Revenue':revenue_total}

purchasing_analysis_total_df = pd.DataFrame(purchasing_analysis_total, index=[0])
purchasing_analysis_total_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [452]:
group_df_gender = purchase_data_df.groupby(['Gender'])
gender_count = group_df_gender['SN'].describe()
gender_count_df = gender_count.rename(columns ={'unique':'Total Count'} )
gender_count_df_total= gender_count_df['Total Count']
a = gender_count.reset_index()
number = a.loc[0,'unique']+a.loc[1,'unique']+a.loc[2,'unique']
a.loc[0,'Percentage'] = a.loc[0,'unique']/number*100
a.loc[1,'Percentage'] = a.loc[1,'unique']/number *100
a.loc[2,'Percentage'] = a.loc[2,'unique']/number *100
a

                  Gender count unique          top freq  Percentage
0                 Female   113     81    Ialallo29    3   14.062500
1                   Male   652    484    Lisosia93    5   84.027778
2  Other / Non-Disclosed    15     11  Chanosian48    2    1.909722

In [441]:
total_purchase_value_gender = group_df_gender['Price'].sum()
avg_purchase_price_gender = group_df_gender['Price'].mean()
purchase_count_gender = group_df_gender['SN'].count()

purchasing_analysis_gender = {'Purchase Count':purchase_count_gender,
    'Average Purchase Price':avg_purchase_price_gender,
    'Total Purchase Value':total_purchase_value_gender
                             }

purchasing_analysis_gender_df = pd.DataFrame(purchasing_analysis_gender)

In [332]:
purchasing_analysis_gender_df

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

In [20]:
bins = [0,9,14,19,24,29,34,39,40]
age_range = ['<10','10-14','15-19','20-24','25-29','30-34','35-39','40+']
purchase_data_df['age_ranges']= pd.cut(purchase_data_df['Age'],bins,labels = age_range, include_lowest=True)

In [284]:
#Age Demographics, The below each broken into bins of 4 years (i.e. <10, 10-14, 15-19, etc.) and calculate 
# Purchase Count,Average Purchase Price, Total Purchase Value and Average Purchase Total per Person by Age Group
age_group = purchase_data_df.groupby(['age_ranges'])
age_sum = age_group['Price'].sum()
age_mean = age_group['Price'].mean()
age_count = age_group['Purchase ID'].count()

age_demographics_table = {
    'Purchase Count':age_count,
    'Average Purchase Price':age_mean,
    'Total Purchase Value':age_sum}

age_table_df = pd.DataFrame(age_demographics_table)
age_table_df.head(8)

            Purchase Count  Average Purchase Price  Total Purchase Value
age_ranges
<10                     23                3.353478                 77.13
10-14                   28                2.956429                 82.78
15-19                  136                3.035956                412.89
20-24                  365                3.052219               1114.06
25-29                  101                2.900990                293.00
30-34                   73                2.931507                214.00
35-39                   41                3.601707                147.67
40+                      6                2.785000                 16.71

In [460]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,age_ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [480]:
purchase_data_df['SN'].value_counts()

Lisosia93      5
Iral74         4
Idastidru52    4
Lisim78        3
Aina42         3
              ..
Hilaerin92     1
Ceoral34       1
Lisista63      1
Layjask75      1
Sisur91        1
Name: SN, Length: 576, dtype: int64

In [501]:
purchase_group_sn = purchase_data_df.groupby(['SN'])
purchase_group_sn['Price'].mean()

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [219]:
purchase_data_df['Item ID'].value_counts()

92     13
178    12
108     9
82      9
145     9
       ..
126     1
134     1
91      1
118     1
104     1
Name: Item ID, Length: 179, dtype: int64

In [504]:
purchase_index = purchase_data_df.set_index(['Item ID'])
popular_items_df = purchase_index.loc[[92,178,108,82,145]]
popular_items = popular_items_df['Item Name'].value_counts()
popular_items.head()

Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Extraction, Quickblade Of Trembling Hands        9
Nirvana                                          9
Fiery Glass Crusader                             9
Name: Item Name, dtype: int64